{
  "text": "Search organization contentEmbedded FilesSkip to main contentSkip to navigationAbout UsVHA Consultants Pte. Ltd./Vincent, Han and Associates is a professional engineering services provider based in Singapore, providing MEP Consultancy Service, M&E Engineering Project Management, Fire Safety Engineering, Registered Inspector Inspection, Fire Certificate Inspection and Qualified Persons services in Singapore and the Asia-Pacific region. The company had attained both ISO 9001 and ISO 14001 certifications .The company have corporatized and name VHA Consultants Pte. Ltd. in 2012The company draws on the expertise of its founder and associates to serve the clients and to provide value added design, quality performance and timely completion of the developments/projects. Our expertise includes: -MEP EngineeringInfrastructure ProjectsCommercial DevelopmentsResidential DevelopmentsInstitutional BuildingsIndustrial BuildingsSpecialty ProjectsData CentresAdditional and Alteration ProjectsShopping Centre Main UpgradingAssets Enhancement ProjectsME plant/ equipment upgrading/ replacementStudies and Analysis Due diligence studiesCivil Defense Engineering and CalculationEnergy AuditFeasibility Studies Fire safety engineeringPerformance based solutionsEngineered Smoke Control DesignPeer ReviewerFire and Life Safety ConsultationsTunnel VentilationsQualified Persons' servicesInfrastructure ProjectsCommercial DevelopmentsResidential DevelopmentsInstitutional BuildingsIndustrial BuildingsDesign and Built Registered Inspector ServiceInfrastructure, Commercial, Residential, Institutional, Industrial and HDB ProjectsAdditional and Alteration ProjectsPerformance Based Alternative Solution ProjectsAnnual Fire Certification Infrastructure ProjectsCommercial DevelopmentsResidential DevelopmentsInstitutional BuildingsIndustrial BuildingsLetter of No ObjectionPerformance based solutionsEngineered Smoke Control DesignGreen Buildings and Sustainability DesignsDesign for Safety CoordinatorsContact usReport abusePage detailsPage updated Report abuse",
  "fetchedAt": "2025-08-18T17:48:44.010Z"
}